Revit 2026 API

# RevisionCloudRevisionId Property

---

The Revision associated with this RevisionCloud.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId RevisionId { get; set; }
```
```vb
Public Property RevisionId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ RevisionId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member RevisionId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: revisionId is not a valid Revision. -or- When setting this property: This operation cannot be performed because revisionId is an issued Revision. |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InvalidOperationException | When setting this property: This operation cannot be performed on a RevisionCloud associated with a Revision that has been issued. |

This property cannot be set to a Revision that has already been issued. If this RevisionCloud is already associated with a Revision that has been issued then this property cannot be changed.

#### Reference

RevisionCloud Class

Autodesk.Revit.DB Namespace